// sample
const 夜使者 = [
  ['刻印', '四飛', '挑釁'],
  ['絕殺', '穢土', '鏢雨'],
  ['四飛', '刻印', '鏢雨'],
  ['穢土', '挑釁', '四飛'],
  ['穢土', '鏢雨', '四飛'],
  ['挑釁', '穢土', '絕殺'],
]

const 閃雷悍將 = [
  ['龍捲', '鯨魚', '消滅'],
  ['升天', '鯨魚', '霹靂'],
  ['升天', '鯨魚', '龍捲'],
  ['龍捲', '消滅', '海浪'],
  ['消滅', '海浪', '鯨魚'],
  ['消滅', '鯨魚', '龍捲'],
  ['消滅', '霹靂', '海浪'],
  ['霹靂', '鯨魚', '海浪'],
  ['霹靂', '龍捲', '升天'],
  ['鯨魚', '升天', '消滅'],
  ['鯨魚', '龍捲', '霹靂'],
  ['鯨魚', '升天', '海浪'],
]

const 卡莉 = [
  ['共鳴', '魔咒', '藝術'],
  ['共鳴', '衝刺', '綻放'],
  ['共鳴', '藝術', '衝刺'],
  ['共鳴', '綻放', '衝刺'],
  ['共鳴', '魔咒', '藝術'],
  ['魔咒', '衝刺', '藝術'],
  ['魔咒', '衝刺', '共鳴'],
  ['突襲', '綻放', '共鳴'],
  // ['藝術', '突襲', '綻放'],
  // ['共鳴', '衝刺', '藝術'],
  // ['綻放', '魔咒', '衝刺'],
  // ['藝術', '魔咒', '突襲'],
]
